final Map<String, Map<String, int>> categories = {
  '의류': {
    '아우터': 1001,
    '상의': 1002,
    '하의': 1003,
    '속옷': 1004,
    '신발': 1005,
  },
  '가전': {
    '대형가전': 7046,
    '주방가전': 7047,
    '미용가전': 7048,
    '욕실가전': 7049,
    '생활가전': 7050,
  },
  '화장품/미용': {
    '스킨케어': 3020,
    '바디케어': 3021,
    '헤어케어': 3022,
    '향수': 3023,
    '클렌징': 3024,
    '메이크업': 3025,
    '네일': 3026,
    '여성용품': 3027,
    '메이크업소품': 3028,
  },
  '출산/유아동': {
    '분유/이유식': 4029,
    '기저귀': 4030,
    '의류': 4031,
    '장난감/완구': 4032,
    '생활용품': 4033,
  },
  '반려동물': {
    '간식': 5034,
    '사료': 5035,
    '의류': 5036,
    '용품': 5037,
  },
  '생활/주방용품': {
    '주방용품': 6038,
    '생활용품': 6039,
    '욕실용품': 6040,
    '수납/정리용품': 6041,
    '청소용품': 6042,
    '위생용품': 6043,
    '보안용품': 6044,
    '세탁용품': 6045,
  },
  '가전': {
    '대형가전': 7046,
    '주방가전': 7047,
    '미용가전': 7048,
    '욕실가전': 7049,
    '생활가전': 7050,
  },
  '디지털': {
    '휴대폰': 8051,
    '웨어러블 디바이스': 8052,
    '태블릿PC': 8053,
    '음향기기': 8054,
    '게이밍': 8055,
    '카메라': 8056,
    '액세서리': 8057,
  },
  '컴퓨터': {
    '노트북': 9058,
    '데스크탑': 9059,
    '모니터': 9060,
    '프린터': 9061,
    '키보드/마우스': 9062,
    '주변기기': 9063,
    '소프트웨어': 9064,
  },
  '도서': {
    '도서': 10000,
  },
  '취미': {
    '취미': 11000,
  },
  '문구': {
    '문구': 12000,
  },
  '악기': {
    '악기': 13000,
  },
  '스포츠/레저': {
    '스포츠/레저': 14000,
  },
  '건강/의료용품': {
    '건강/의료용품': 15000,
  },
  '차량용품': {
    '차량용품': 16000,
  },
  '공구': {
    '공구': 17000,
  },
  '기념품': {
    '기념품': 18000,
  },
  '서류': {
    '서류': 19000,
  },
  '식품': {
    '식품': 20000,
  },
};

String getCategoryName(int? category) {
  if (category == null) {
    return "카테고리 없음";
  }

  // 카테고리 이름을 저장할 변수
  String categoryName = '';

  // 최상위 카테고리 탐색
  for (var mainCategory in categories.entries) {
    // 하위 카테고리 탐색
    for (var subCategory in mainCategory.value.entries) {
      if (subCategory.value == category) {
        // 카테고리가 일치하는 경우
        categoryName = '${mainCategory.key} > ${subCategory.key}';
        if (mainCategory.key == subCategory.key){
          categoryName = '${mainCategory.key}';
        }
        return categoryName; // 찾으면 즉시 반환
      }
    }
  }

  // 카테고리를 찾지 못한 경우
  return "카테고리 없음";
}
